app/Controllers/Admin.php

    public function categorytable()
    {
        $category = new \App\Models\CategoryModel();
        $data = $category->findAll();
---
SELECT *
FROM `category`

    public function product()
    {
        $category = new \App\Models\CategoryModel();
        $data = $category->findAll();
        $subcategory = new \App\Models\SubcategoryModel();
        $data1 = $subcategory->findAll();
---
SELECT *
FROM `subcategory`

    public function display()
    {
        $product = new \App\Models\ProductModel();
        $data = $product->findAll();
---
SELECT *
FROM `product`