app/Controllers/Cart.php

    public function buy($id = null)
    {
        if (session('login') != true) {
            return redirect()->to('login');
        } else {
            $myTime = new Time('now');
            $newsession = new CartModel();
            $product = new ProductModel();
            $order = new OrdersModel();

            $fetch = $newsession->where('user_id', session('userid'))->where('order_status', 0)->first();
            $pro = $product->find($id);
---
SELECT *
FROM `cart`
WHERE `user_id` = '3'
AND `order_status` = 0
 LIMIT 1
SELECT *
FROM `product`
WHERE `product`.`id` = '15'

                        'id' => $pid['id'],
                        'product_quantity' => $pid['product_quantity']+1
                    ];
                    $order->save($up);
---
UPDATE `order` SET `id` = '3', `product_quantity` = 9
WHERE `order`.`id` IN ('3')