app/Controllers/Home.php

SELECT *
FROM `product`
---
    public function shop()
    {
        $product = new \App\Models\ProductModel();
        $data = $product->findAll();

SELECT *
FROM `product`
WHERE `product`.`id` = '15'
---
    public function single_product($id = null)
    {
        // $similar = new \App\Models\ProductModel();
        // $data1 = $similar->findAll();
        $product = new \App\Models\ProductModel();
        $data =$product->find($id);