app/Controllers/product.php

INSERT INTO `product` (`product_name`, `product_img`, `product_price`, `product_qty`, `category`, `subcategory`) VALUES ('Linus Bradford', 'pic3.jpg', '125', '702', '3', '6')
---
    public function products()
    {
        $name = $this->request->getVar("pname");
        // $image = $this->request->getFile("image");
        $price = $this->request->getVar("price");
        $qty = $this->request->getVar("qty");
        $category = $this->request->getVar("categories");
        $subcategory = $this->request->getVar("subcategories");

        $productModel = new \App\Models\ProductModel();
        $file = $this->request->getFile('image');
        if ($file->isValid() && !$file->hasMoved()) {
        $imageName = $file->getName();
        $file->move('public/uploads/', $imageName);
        }
        $values = [
            'product_name' => $name,
            'product_img' => $imageName,
            'product_price' => $price,
            'product_qty' => $qty,
            'category' => $category,
            'subcategory' => $subcategory,

        ];
        // $productModel = new \App\Models\ProductModel();
        $query = $productModel->insert($values);